covid-19-buddy/be/covid-19-buddy-be/covid-buddy-be/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", ""], ["LIMIT", 1]]
---
  def login
    #byebug
    user = User.find_by(username: params[:user][:username])