covid-19-buddy/be/covid-19-buddy-be/covid-buddy-be/app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @entries = Entry.all