covid-19-buddy/be/covid-19-buddy-be/covid-buddy-be/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "firstname", "lastname", "password_digest", "age", "bio", "pronouns", "gender", "profileimg", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"